---
kind: type
id: T:Autodesk.Revit.DB.WorksharingSaveAsOptions
source: html/b213ac5b-8453-abb7-9853-4861ce8b189f.htm
---
# Autodesk.Revit.DB.WorksharingSaveAsOptions

This class contains options specific to worksharing SaveAs.

## Syntax (C#)
```csharp
public class WorksharingSaveAsOptions : IDisposable
```